"""
2020年02月06号
"""
__all__ = [
    'NANJIN_METRO_BASE_INFO',
    'CROSS_STATIONS',
    'STATION_RELATED_LINES',
    'LINE_RELATED_STATIONS',
    'LINE_KNOWN_LINES',
]

# 站台基本信息
M_1_STATIONS = (
    '八卦洲大桥南站','笆斗山站','燕子矶站','吉祥庵站','晓庄站',
    '迈皋桥站','红山动物园站','南京站','新模范马路站','玄武门站',
    '鼓楼站','珠江路站','新街口站','张府园站','三山街站',
    '中华门站','安德门站','天隆寺站','软件大道站','花神庙站',
    '南京南站','双龙大道站','河定桥站','胜太路站','百家湖站',
    '小龙湾站','竹山路站','天印大道站','龙眠大道站','南医大·江苏经贸学院站',
    '南京交院站','中国药科大学站',
)
M_2_STATIONS = (
    '鱼嘴站','天保街站','青莲街站','螺塘路站','油坊桥站',
    '雨润大街站','元通站','奥体东站','兴隆大街站','集庆门大街站',
    '云锦路站','莫愁湖站','汉中门站','上海路站','新街口站',
    '大行宫站','西安门站','明故宫站','苜蓿园站','下马坊站',
    '孝陵卫站','钟灵街站','马群站','金马路站','仙鹤门站',
    '学则路站','仙林中心站','羊山公园站','南大仙林校区站','经天路站',
)
M_3_STATIONS = (
    '南京北站','林场站','星火路站','东大成贤学院站','泰冯路站',
    '天润城站','柳洲东路站','上元门站','五塘广场站','小市站',
    '南京站','南京林业大学·新庄站','鸡鸣寺站','浮桥站','大行宫站',
    '常府街站','夫子庙站','武定门站','雨花门站','卡子门站',
    '大明路站','明发广场站','南京南站','宏运大道站','胜太西路站',
    '天元西路站','九龙湖站','诚信大道站','东大九龙湖校区站','秣周东路站',
    '和风路站','秣陵街道站',
)
M_4_STATIONS = (
    '南京北站','野生动物园站','珍珠泉站','定向河北站','浦珠路站',
    '浦江站','中央商务区站','滨江站','龙江站','草场门站',
    '云南路站','鼓楼站','鸡鸣寺站','九华山站','岗子村站',
    '蒋王庙站','王家湾站','聚宝山站','徐庄站','金马路站',
    '汇通路站','灵山站','东流站','孟北站','西岗桦墅站',
    '仙林湖站',
)
M_10_STATIONS = (
    '雨山路站','文德路站','龙华路站','南京工业大学站','浦口万汇城站',
    '临江站','江心洲站','绿博园站','梦都大街站','奥体中心站',
    '元通站','中胜站','小行站','安德门站','共青团路站',
    '雨花台站','卡子门站','红花机场站','机场路站','河湾站',
    '七桥瓮公园站','杨庄站','王武庄站','东麒路站','石杨东路站',
)
M_S1_STATIONS = (
    '南京南站','翠屏山站','河海大学·佛城西路站','吉印大道站','正方中路站',
    '翔宇路北站','翔宇路南站','禄口机场站','空港新城江宁站',
)
M_S3_STATIONS = (
    '南京南站','景明佳园站','铁心桥站','春江路站','贾西站',
    '油坊桥站','永初路站','平良大街站','吴侯街站','高庙路站',
    '天保站','刘村站','马骡圩站','兰花塘站','双垅站',
    '石碛河站','桥林新城站','林山站','高家冲站',
)
M_S7_STATIONS = (
    '空港新城江宁站','柘塘站','空港新城溧水站','群力站','卧龙湖站',
    '溧水站','中山湖站','幸庄站','无想山站',
)
M_S8_STATIONS = (
    '浦口公园站','柳洲南路站','长江大桥北站','毛纺厂路站','泰山新村站',
    '泰冯路站','高新开发区站','信息工程大学站','卸甲甸站','大厂站',
    '葛塘站','长芦站','化工园站','六合开发区站','龙池站',
    '雄州站','凤凰山公园站','方州广场站','沈桥站','八百桥站',
    '金牛湖站',
)
M_S9_STATIONS = (
    '翔宇路南站','铜山站','石湫站','明觉站','团结圩站',
    '高淳站',
)

# 南京地铁基本信息
NANJIN_METRO_BASE_INFO = {
    '1号线':{
        'mileage':'38.9', # 单位km
        'counts':'27',
        'color':'blue',
        'start_time':'2005/5/15',
        'STATIONS':M_1_STATIONS,
        'groups':'6A', # 车辆编组
    },
    '2号线':{
        'mileage':'37.95',
        'counts':'26',
        'color':'red',
        'start_time':'2010/5/28',
        'STATIONS':M_2_STATIONS,
        'groups':'6A',
    },
    '3号线':{
        'mileage':'44.9',
        'counts':'29',
        'color':'green',
        'start_time':'2015/4/1',
        'STATIONS':M_3_STATIONS,
        'groups':'6A',
    },
    '4号线':{
        'mileage':'33.8',
        'counts':'18',
        'color':'violet',
        'start_time':'2017/1/18',
        'STATIONS':M_4_STATIONS,
        'groups':'6B',
    },
    '10号线':{
        'mileage':'21.6',
        'counts':'14',
        'color':'champagne', # 香槟色
        'start_time':'2014/7/1',
        'STATIONS':M_10_STATIONS,
        'groups':'6A',
    },
    'S1号线':{
        'mileage':'37.3',
        'counts':'9',
        'color':'turquoise', # 宝石绿
        'start_time':'2014/7/1',
        'STATIONS':M_S1_STATIONS,
        'groups':'6B',
    },
    'S3号线':{
        'mileage':'36.22',
        'counts':'19',
        'color':'lavender', # 粉紫色
        'start_time':'2017/12/6',
        'STATIONS':M_S3_STATIONS,
        'groups':'6B',
    },
    'S7号线':{
        'mileage':'30.16',
        'counts':'9',
        'color':'thin_red_plum', # 薄红梅色
        'start_time':'2018/5/26',
        'STATIONS':M_S7_STATIONS,
        'groups':'4B/6B',
    },
    'S8号线':{
        'mileage':'45.2',
        'counts':'17',
        'color':'dark_orange', # 深橘黄色
        'start_time':'2014/8/1',
        'STATIONS':M_S8_STATIONS,
        'groups':'4B',
    },
    'S9号线':{
        'mileage':'52.4',
        'counts':'6',
        'color':'bright_yellow', # 明黄色
        'start_time':'2017/12/30',
        'STATIONS':M_S9_STATIONS,
        'groups':'3B',
    },
}


"""
#########################################################
下面是依赖上述数据产生的新的数据，具体途径来自tools包里面的各种函数。
#########################################################
"""

# 请调用tools._search_all_cross_station()更新CROSS_STATIONS
CROSS_STATIONS = {'卡子门站', '鼓楼站', '泰冯路站', '油坊桥站', '翔宇路南站', '南京南站', '金马路站', '南京北站', '元通站', '南京站', '大行宫站', '安德门站', '空港新城江宁站', '新街口站', '鸡鸣寺站'}

# 请调用tools._match_belong_lines()更新STATION_RELATED_LINES
STATION_RELATED_LINES = {
    '元通站': ['2号线', '10号线'],
    '南京北站': ['3号线', '4号线'],
    '南京南站': ['1号线', '3号线', 'S1号线', 'S3号线'],
    '南京站': ['1号线', '3号线'],
    '卡子门站': ['3号线', '10号线'],
    '大行宫站': ['2号线', '3号线'],
    '安德门站': ['1号线', '10号线'],
    '新街口站': ['1号线', '2号线'],
    '油坊桥站': ['2号线', 'S3号线'],
    '泰冯路站': ['3号线', 'S8号线'],
    '空港新城江宁站': ['S1号线', 'S7号线'],
    '翔宇路南站': ['S1号线', 'S9号线'],
    '金马路站': ['2号线', '4号线'],
    '鸡鸣寺站': ['3号线', '4号线'],
    '鼓楼站': ['1号线', '4号线'],
} # 中转站所在的线路归属

# 请调用tools._match_belong_stations更新LINE_RELATED_STATIONS
LINE_RELATED_STATIONS = {
    '10号线': ['卡子门站', '元通站', '安德门站'],
    '1号线': ['鼓楼站', '南京南站', '南京站', '安德门站', '新街口站'],
    '2号线': ['金马路站', '大行宫站', '油坊桥站', '元通站', '新街口站'],
    '3号线': ['南京北站', '大行宫站', '卡子门站', '泰冯路站', '鸡鸣寺站', '南京南站', '南京站'],
    '4号线': ['南京北站', '金马路站', '鼓楼站', '鸡鸣寺站'],
    'S1号线': ['南京南站', '空港新城江宁站', '翔宇路南站'],
    'S3号线': ['油坊桥站', '南京南站'],
    'S7号线': ['空港新城江宁站'],
    'S8号线': ['泰冯路站'],
    'S9号线': ['翔宇路南站'],
} # 线路上的所有中转站

# 请调用tools._line_known_lines更新LINE_KNOWN_LINES
LINE_KNOWN_LINES = {
    '10号线': ('1号线', '2号线', '3号线'),
    '1号线': ('10号线', '2号线', '3号线', '4号线', 'S1号线', 'S3号线'),
    '2号线': ('10号线', '1号线', '3号线', '4号线', 'S3号线'),
    '3号线': ('10号线', '1号线', '2号线', '4号线', 'S1号线', 'S3号线', 'S8号线'),
    '4号线': ('1号线', '2号线', '3号线'),
    'S1号线': ('1号线', '3号线', 'S3号线', 'S7号线', 'S9号线'),
    'S3号线': ('1号线', '2号线', '3号线', 'S1号线'),
    'S7号线': ('S1号线',),
    'S8号线': ('3号线',),
    'S9号线': ('S1号线',)
} # 线路连接线路
